<?php

#задание 1
$age = 19; # создаем переменную возраста 

$status = $age > 18 ? "да" : "нет"; # проверяем больше ли возраст, чем требуемый 
$status2 = $age == 18 ? "да" : "нет"; # проверяем равен ли возраст, чем требуемому
$status3 = $age < 18 ? "да" : "нет"; # проверяем меньше ли возраст, чем требуемый
$status4 = $age >= 18 ? "да" : "нет"; # проверяем больше или равен ли возраст, чем требуемый

echo 'Больше ли 18? - ' . $status; # выводим проверку 
echo ' Равен ли 18? - ' . $status2; # выводим проверку 
echo ' Меньше ли 18? - ' . $status3; # выводим проверку 
echo ' Больше или равен ли 18? - ' . $status4; # выводим проверку 

#задание 2

$price = 2500; # создаем переменную цены
$quantity = 3; # создаем переменную количества 
$discount = 0.1; # создаем переменную скидки 
$resilt = ($price * $quantity) - ($price * ($discount * $quantity)); # высчитываем цену вместе со скидкой и количества товара 
$status = $resilt > 5000 ? "Превышает" : "Не превышает"; # проверяем превышает ли итоговая цена рубеж в 5000.  

echo " Стоисмоть: " . $price * $quantity; # выводим стоимость товара в количества трех штук 
echo " Размер скидки: " . $price * $discount; # выводим размер скидки на один товар 
echo "Итоговая: " . $resilt; # выводим итоговую цену 
echo " Привышает ли 5000? - " . $status; # выводим результат проверки 