<?php

#задание 1

$name = "Филипп"; # создаем переменную имени
$Surname = "Киркоров"; # создаем переменную фамилии 
$age = 59; # создаем переменную возраста
$city = "Москва"; # создаем переменную города
$averageScore = 4.5; # создаем переменную среднего балла 

echo "Имя: $name."  . " Фамилия: $Surname."  . " Возраст: $age."  . " Город: $city."  .  " Средний балл: $averageScore. "; # выводим все данные, параллельно подписав их

#задание 2

$price = 1500; # создаем переменную цены
$quantity = 3; # создаем переменную количества 

echo $price * $quantity; # высчитываем полную цену


#задание 3

$firstName = "Иван"; # создаем переменную имени
$lastName = "Петров"; # создаем переменную фамилии 

echo 'У меня есть друг: ' . $firstName . $lastName  . "У меня есть друг:  $firstName  $lastName "; # выводим нужные нам значения используя одинарные и двойные ковычки 


#задание 4

$string = "Hello, World"; # создаем переменную строки 
$integer = 32; # создаем переменную целого числа (int)
$float = 3.1; # создаем переменную дробного числа (float)
$boolean = true; # создаем переменную будевого значения 
$null = null;  # создаем пустую переменную
$array = ["Hi", 32, false]; # создаем массив 

echo var_dump($string) . var_dump($integer) . var_dump($float) . var_dump($boolean) . var_dump($null) . var_dump($array); # выводим информацию о каждый переменной через var_dump

